app/views/articles/index.html.erb

INSERT INTO "articles" ("title", "contents", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "awdaw"], ["contents", "dawdaw"], ["user_id", 1], ["created_at", "2018-08-27 15:31:02.342863"], ["updated_at", "2018-08-27 15:31:02.342863"]]
---
                    <a href="#" class="post-article">
                        <time class="post-article-date" datetime="<%= a.created_at %>"><%= a.created_at.to_date.to_formatted_s(:rfc822) %></time>