app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "contents", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "awdaw"], ["contents", "dawdaw"], ["user_id", 1], ["created_at", "2018-08-27 15:31:02.342863"], ["updated_at", "2018-08-27 15:31:02.342863"]]
---
	def create
		if params
			@article = Article.new(article_params)
			@article.user_id = current_user.id
			if @article.save