app/controllers/blog_controller.rb

SELECT  "articles".* FROM "articles" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"
---
	def archives
		@articles = Article.paginate(:page => params[:page], :per_page => 5)